<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
   /**
   * Seed the application's database.
   *
   * @return void
   */
   public function run()
   {
      // $this->call(UserSeeder::class);


      DB::table('roles')->insert([
         ["name"=>"Админ"],
         ["name"=>"Модератор"],
         ["name"=>"Врач"],
         ["name"=>"Пациент"],
         ["name"=>"Служба поддержки"],
         ["name"=>"Тех. поддержки"]
      ]);

      DB::table('cities')->insert([
         ["name"=>"Нур-Султан"],
         ["name"=>"Алматы"],
         ["name"=>"Шымкент"],
         ["name"=>"Атырау"],
         ["name"=>"Есик"],
         ["name"=>"Казалинск"],
         ["name"=>"Капчагай"],
         ["name"=>"Лисаковск"],
         ["name"=>"Степногорск"],
         ["name"=>"Степняк"],
         ["name"=>"Ушарал"],
         ["name"=>"Хромтау"],
         ["name"=>"Абай"],
         ["name"=>"Алга"],
         ["name"=>"Балхаш"],
         ["name"=>"Жетысай"],
         ["name"=>"Зыряновск"],
         ["name"=>"Кандыагаш"],
         ["name"=>"Костанай"],
         ["name"=>"Павлодар"],
         ["name"=>"Петропавловск"],
         ["name"=>"Приозерск"],
         ["name"=>"Риддер"],
         ["name"=>"Сары-Агаш"],
         ["name"=>"Серебрянск"],
         ["name"=>"Талгар"],
         ["name"=>"Тараз"],
         ["name"=>"Текели"],
         ["name"=>"Темиртау"],
         ["name"=>"Форт-Шевченко"],
         ["name"=>"Аксай"],
         ["name"=>"Актюбинск"],
         ["name"=>"Аральск"],
         ["name"=>"Аркалык"],
         ["name"=>"Асу-Булак"],
         ["name"=>"Байконур"],
         ["name"=>"Жанаозен"],
         ["name"=>"Жем"],
         ["name"=>"Житикара"],
         ["name"=>"Каратау"],
         ["name"=>"Кентау"],
         ["name"=>"Кульсары"],
         ["name"=>"Курчатов"],
         ["name"=>"Кызылорда"],
         ["name"=>"Макинск"],
         ["name"=>"Мамлютка"],
         ["name"=>"Рудный"],
         ["name"=>"Сергеевка"],
         ["name"=>"Уральск"],
         ["name"=>"Усть-Каменогорск"],
         ["name"=>"Достык"],
         ["name"=>"Акколь"],
         ["name"=>"Актау"],
         ["name"=>"Аягоз"],
         ["name"=>"Булаево"],
         ["name"=>"Державинск"],
         ["name"=>"Жанатас"],
         ["name"=>"Жаркент"],
         ["name"=>"Зайсан"],
         ["name"=>"Караганда"],
         ["name"=>"Каражал"],
         ["name"=>"Каскелен"],
         ["name"=>"Кокшетау"],
         ["name"=>"Сарканд"],
         ["name"=>"Сатпаев"],
         ["name"=>"Семипалатинск"],
         ["name"=>"Тайынша"],
         ["name"=>"Талдыкорган"],
         ["name"=>"Темир"],
         ["name"=>"Туркестан"],
         ["name"=>"Уштобе"],
         ["name"=>"Аксу"],
         ["name"=>"Ерейментау"],
         ["name"=>"Жезказган"],
         ["name"=>"Каркаралинск"],
         ["name"=>"Ленгер"],
         ["name"=>"Кордай"],
         ["name"=>"Отеген Батыра"],
      ]);


      DB::table('clinics')->insert([
         ['name' => 'ГКП на ПХВ «ГП № 1»', 'city_id' => 1],
         ['name' => 'ГКП на ПХВ «ГП № 2»', 'city_id' => 1],
         ['name' => 'ГКП на ПХВ «ГП № 11»', 'city_id' => 1],
         ['name' => 'ГКП на ПХВ «ГП № 12»', 'city_id' => 1],
         ['name' => 'ГКП на ПХВ «ГП № 13»', 'city_id' => 1],
         ['name' => 'ГКП на ПХВ "ГП №1"', 'city_id' => 2],
         ['name' => 'ГКП на ПХВ "ГП №2"', 'city_id' => 2],
         ['name' => 'ГКП на ПХВ "ГП №3"', 'city_id' => 2],
         ['name' => 'ГКП на ПХВ "ГП №4"', 'city_id' => 2],
         ['name' => 'ГКП на ПХВ "ГП №5"', 'city_id' => 2]
      ]);


      DB::table('specializations')->insert([
         ["name" => "Акушер-гинеколог"],
         ["name"=>"Аллерголог"],
         ["name"=>"Ангиохирург"],
         ["name"=>"Аритмолог"],
         ["name"=>"ВОП"],
         ["name"=>"Гастроэнтеролог"],
         ["name"=>"Гематолог"],
         ["name"=>"Гепатолог"],
         ["name"=>"Дерматовенеролог (дерматолог)"],
         ["name"=>"Диетолог"],
         ["name"=>"Иммунолог"],
         ["name"=>"Инфекционист"],
         ["name"=>"Кардиолог"],
         ["name"=>"Кардиохирург"],
         ["name"=>"Косметолог"],
         ["name"=>"Логопед"],
         ["name"=>"ЛОР (отоларинголог)"],
         ["name"=>"Маммолог"],
         ["name"=>"Мануальный терапевт"],
         ["name"=>"Медицинский сервис"],
         ["name"=>"Нарколог"],
         ["name"=>"Невропатолог"],
         ["name"=>"Нейрохирург"],
         ["name"=>"Неонатолог"],
         ["name"=>"Нефролог"],
         ["name"=>"Онколог"],
         ["name"=>"Офтальмолог"],
         ["name"=>"Педиатр"],
         ["name"=>"Проктолог"],
         ["name"=>"Психолог"],
         ["name"=>"Психотерапевт"],
         ["name"=>"Пульмонолог"],
         ["name"=>"Радиолог"],
         ["name"=>"Реабилитолог"],
         ["name"=>"Ревматолог"],
         ["name"=>"Рефлексотерапевт"],
         ["name"=>"Стоматолог"],
         ["name"=>"Терапевт"],
         ["name"=>"Травматолог (ортопед)"],
         ["name"=>"УЗИ-специалист"],
         ["name"=>"Уролог (андролог)"],
         ["name"=>"Физиотерапевт"],
         ["name"=>"Фтизиатр"],
         ["name"=>"Химиотерапевт"],
         ["name"=>"Хирург"],
         ["name"=>"Эндокринолог"],
      ]);

      DB::table('categories')->insert([
         ["name" => "Детский"],
         ["name" => "Взрослый"],
         ["name" => "Детский/Взрослый"],
      ]);

      DB::table('qualifications')->insert([
         ["name" => "Высшая категория"],
         ["name" => "Первая категория"],
         ["name" => "Вторая категория"],
         ["name" => "Без категории"],
      ]);

      DB::table('languages')->insert([
         [
            'short_name' => 'ru',
            'name' => 'Русский',
         ],
         [
            'short_name' => 'kk',
            'name' => 'Қазақша',
         ],
         [
            'short_name' => 'en',
            'name' => 'English',
         ],
      ]);

   }
}
